In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({
    "Col1" : [1,2,3,4,5,6,7,8,9],
    "Col2" : [11,12,13,14,15,16,17,18,19]
})
df

   Col1  Col2
0     1    11
1     2    12
2     3    13
3     4    14
4     5    15
5     6    16
6     7    17
7     8    18
8     9    19

In [3]:
df.apply(lambda x : x**2)

   Col1  Col2
0     1   121
1     4   144
2     9   169
3    16   196
4    25   225
5    36   256
6    49   289
7    64   324
8    81   361

In [4]:
df["Col1"].apply(lambda x : x**2)

0     1
1     4
2     9
3    16
4    25
5    36
6    49
7    64
8    81
Name: Col1, dtype: int64

In [5]:
df[::2].apply(lambda x : x**2)

   Col1  Col2
0     1   121
2     9   169
4    25   225
6    49   289
8    81   361

In [6]:
for i in df.index:
    if i % 2 == 0:
        df.iloc[i] = df.iloc[i].apply(lambda x : x**2)

In [7]:
df

   Col1  Col2
0     1   121
1     2    12
2     9   169
3     4    14
4    25   225
5     6    16
6    49   289
7     8    18
8    81   361

In [8]:
df.iloc[1]

Col1     2
Col2    12
Name: 1, dtype: int64

In [9]:
df.iloc[0]

Col1      1
Col2    121
Name: 0, dtype: int64

In [10]:
for i in df.index:
    if i % 2 != 0:
        df.iloc[i] = df.iloc[i].apply(lambda x : x**2)

In [11]:
df

   Col1  Col2
0     1   121
1     4   144
2     9   169
3    16   196
4    25   225
5    36   256
6    49   289
7    64   324
8    81   361

In [12]:
table = pd.DataFrame(
    {
        "Col1" : np.array([1,2,3,4,5]),
        "Col2" : np.array([10,20,30,40,50])
    }
)
display(table)
table.dtypes

   Col1  Col2
0     1    10
1     2    20
2     3    30
3     4    40
4     5    50

Col1    int32
Col2    int32
dtype: object

In [13]:
table[["Col1"]].apply(lambda x : x**2)
display(table[["Col1"]])
table.dtypes

   Col1
0     1
1     2
2     3
3     4
4     5

Col1    int32
Col2    int32
dtype: object

In [14]:
table

   Col1  Col2
0     1    10
1     2    20
2     3    30
3     4    40
4     5    50

In [15]:
def Add(num):
    return num + num

In [16]:
table[["Col1"]].apply(Add)

   Col1
0     2
1     4
2     6
3     8
4    10

In [17]:
cnt = pd.DataFrame({
    "Country" : ["India", "Uk", "Usa"],
    "Capital" : ["Delhi", "Londan", "Washington Dc"]
})
cnt

  Country        Capital
0   India          Delhi
1      Uk         Londan
2     Usa  Washington Dc

In [18]:
cnt["Country"].apply(lambda x : x.upper())

0    INDIA
1       UK
2      USA
Name: Country, dtype: object

In [19]:
def upper(x):
    return x.upper()

In [20]:
cnt["Country"].apply(upper)

0    INDIA
1       UK
2      USA
Name: Country, dtype: object

In [21]:
cnt["Country"] = cnt["Country"].apply(upper)
cnt["Capital"] = cnt["Capital"].apply(upper)

cnt

  Country        Capital
0   INDIA          DELHI
1      UK         LONDAN
2     USA  WASHINGTON DC

In [22]:
cnt["Capital"] = cnt["Capital"].apply(lambda x : x.swapcase())

In [23]:
cnt

  Country        Capital
0   INDIA          delhi
1      UK         londan
2     USA  washington dc

In [24]:
cnt["Capital"] = cnt["Capital"].apply(lambda x : x.title())
cnt

  Country        Capital
0   INDIA          Delhi
1      UK         Londan
2     USA  Washington Dc

In [25]:
cnt["Capital"] = cnt["Capital"].apply(lambda x : x + "232@@#$%&*@")
cnt["Country"] = cnt["Capital"].apply(lambda x : x + "232@@#$%&*@")

cnt

                               Country                   Capital
0          Delhi232@@#$%&*@232@@#$%&*@          Delhi232@@#$%&*@
1         Londan232@@#$%&*@232@@#$%&*@         Londan232@@#$%&*@
2  Washington Dc232@@#$%&*@232@@#$%&*@  Washington Dc232@@#$%&*@

In [26]:
cnt

                               Country                   Capital
0          Delhi232@@#$%&*@232@@#$%&*@          Delhi232@@#$%&*@
1         Londan232@@#$%&*@232@@#$%&*@         Londan232@@#$%&*@
2  Washington Dc232@@#$%&*@232@@#$%&*@  Washington Dc232@@#$%&*@

In [27]:
import string
letters = string.ascii_letters + " "

In [28]:
def clean(string):
    letr = ""
    for i in string:
        if i in letters:
            letr += i 
    return letr 

clean("Washington Dc232@@#%&*@")

'Washington Dc'

In [29]:
cnt["Country"] = cnt["Country"].apply(clean)
cnt["Capital"] = cnt["Capital"].apply(clean)
cnt

         Country        Capital
0          Delhi          Delhi
1         Londan         Londan
2  Washington Dc  Washington Dc

In [31]:
import datetime as dt

In [33]:
today = dt.datetime.now().date()
today

datetime.date(2022, 10, 13)

In [46]:
for i in range(5):
    new_today = today + dt.timedelta(days = i)
    up_date = new_today.strftime("%d-%m-%Y")
    print(up_date)

11-01-2023
12-01-2023
13-01-2023
14-01-2023
15-01-2023

In [45]:
cnt_date = pd.DataFrame({
    "Country" : ["India", "Uk", "Usa"],
    "Capital" : ["Delhi", "Londan", "Washington Dc"],
    "Date" : ["01-01-2023", "02-01-2023", "04-01-2023"]
})
cnt_date

  Country        Capital        Date
0   India          Delhi  01-01-2023
1      Uk         Londan  02-01-2023
2     Usa  Washington Dc  04-01-2023

In [50]:
cnt_date["Date"] = cnt_date["Date"].apply(lambda date : dt.datetime.strptime(date, "%d-%m-%Y"))

In [52]:
cnt_date

  Country        Capital       Date
0   India          Delhi 2023-01-01
1      Uk         Londan 2023-01-02
2     Usa  Washington Dc 2023-01-04